// разработать класс для объекта Student с privat полями ФИО (чтение и записи), дата поступления (запись), адресс(чтение) телефон (чтение и запись) курс (запись) факультет (чтение)
// включить в класс метод доступа. 
// создать массив из трех объектов 
// вывести фио всех сотудников список сдутентов заданного факультета список сотрудников поступающих после заданного года
// создать класс с полями wight (ширина) и height (высота) сделать привытными 
// сеттеры должны проверять чтобы значение были больше нуля 
// добавить методы getArea() (площать) и getPremier() (приметер) возваращаемые значения