// Напишите программу, которая принимает массив строк и формирует одну строку, объединяющую все элементы массива через запятую.

using System;
class Program
{
    static void Main()
    {
        string[] words = { "apple", "banana", "cherry" };
        string result = "";

        foreach (var word in words)
        {
            
        }
        Console.WriteLine(countPositive);
    }
}
